## Commonly used with aggregation functions like sum(), mean(), count(), min(), max(), median()

In [9]:
import pandas as pd

data = {'Name': ['Babar', 'Rizwan', 'Babar', 'Salman', 'Rizwan', 'Babar'],
            'score': [10, 15, 12, 20, 18, 11]}
df = pd.DataFrame(data)

df.head()

     Name  score
0   Babar     10
1  Rizwan     15
2   Babar     12
3  Salman     20
4  Rizwan     18

In [19]:
# Group by 'Category' and calculate the mean of 'Value'
grouped_df = df.groupby('Name')['score'].mean()
df=pd.DataFrame(grouped_df)
df.head()

        score
Name
Babar    11.0
Rizwan   16.5
Salman   20.0

In [2]:
data = {'Category1': ['X', 'Y', 'X', 'Y', 'X'],
        'Category2': ['P', 'Q', 'Q', 'P', 'P'],
        'Value': [1, 2, 3, 4, 5]}
df = pd.DataFrame(data)

grouped_multiple = df.groupby(['Category1', 'Category2'])['Value'].sum()
print(grouped_multiple)

Category1  Category2
X          P            6
           Q            3
Y          P            4
           Q            2
Name: Value, dtype: int64